In [2]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [6]:
import pandas as pd

df = pd.read_csv('titanic_train.csv')
summer = pd.read_csv('summer.csv')
df.head()

   passenger_id  pclass  ...                 home.dest survived
0          1216       3  ...                       NaN        1
1           699       3  ...                   Croatia        0
2          1267       3  ...                       NaN        0
3           449       2  ...      Cornwall / Akron, OH        1
4           576       2  ...  Barre, Co Washington, VT        0

[5 rows x 15 columns]

In [7]:
summer.head()

   Year    City     Sport  ... Gender                       Event   Medal
0  1896  Athens  Aquatics  ...    Men              100M Freestyle    Gold
1  1896  Athens  Aquatics  ...    Men              100M Freestyle  Silver
2  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors  Bronze
3  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors    Gold
4  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors  Silver

[5 rows x 9 columns]

In [9]:
pd.to_numeric(df['Meal Price'], errors='coerce')

Series([], Name: sex, dtype: object)

In [10]:
df.loc[df.sex == 'male']['fare']

1        8.6625
4       13.0000
5       22.5250
6        0.0000
10     211.5000
         ...
843      6.4958
844     90.0000
845     50.0000
846     29.7000
849     13.0000
Name: fare, Length: 551, dtype: float64

In [12]:
len(df.age.unique()) == df.age.nunique(dropna=False)

True

In [15]:
df.columns

Index(['passenger_id', 'pclass', 'name', 'sex', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest',
       'survived'],
      dtype='object')

In [16]:
summer.columns

Index(['Year', 'City', 'Sport', 'Discipline', 'Athlete', 'Country', 'Gender',
       'Event', 'Medal'],
      dtype='object')

In [17]:
df.dtypes

passenger_id      int64
pclass            int64
name             object
sex              object
age             float64
sibsp             int64
parch             int64
ticket           object
fare            float64
cabin            object
embarked         object
boat             object
body            float64
home.dest        object
survived          int64
dtype: object

In [18]:
mask2 = df.dtypes == object
mask = df.sex == 'male'
df.loc[df.sex == 'male', ~mask2]

     passenger_id  pclass   age  sibsp  parch      fare   body  survived
1             699       3  38.0      0      0    8.6625    NaN         0
4             576       2  40.0      0      0   13.0000    NaN         0
5            1083       3  28.0      0      0   22.5250  173.0         0
6             898       3  19.0      0      0    0.0000    NaN         0
10            313       1  27.0      0      2  211.5000    NaN         0
..            ...     ...   ...    ...    ...       ...    ...       ...
843          1288       3  18.0      1      0    6.4958  314.0         0
844           165       1  38.0      1      0   90.0000    NaN         1
845           158       1  55.0      0      0   50.0000    NaN         0
846           174       1  58.0      0      0   29.7000  258.0         0
849           425       2  52.0      0      0   13.0000   19.0         0

[551 rows x 8 columns]

In [19]:
summer.columns

Index(['Year', 'City', 'Sport', 'Discipline', 'Athlete', 'Country', 'Gender',
       'Event', 'Medal'],
      dtype='object')

In [21]:
df.nsmallest(n = 2, columns='age')

     passenger_id  pclass  ...                   home.dest survived
151           763       3  ...  Devon, England Wichita, KS        1
294          1240       3  ...                         NaN        1

[2 rows x 15 columns]

In [23]:
summer.Year.dtype

dtype('int64')

In [22]:
summer.Year.unique()

array([1896, 1900, 1904, 1908, 1912, 1920, 1924, 1928, 1932, 1936, 1948,
       1952, 1956, 1960, 1964, 1968, 1972, 1976, 1980, 1984, 1988, 1992,
       1996, 2000, 2004, 2008, 2012])

In [25]:
df_04 = summer.loc[summer.Year == 1904]
df_08 = summer.loc[summer.Year == 1908]
df_12 = summer.loc[summer.Year == 1912]


pd.concat([df_04, df_08, df_12])

      Year       City  ...                            Event   Medal
663   1904   St Louis  ...                     10M Platform  Bronze
664   1904   St Louis  ...                     10M Platform  Bronze
665   1904   St Louis  ...                     10M Platform    Gold
666   1904   St Louis  ...                     10M Platform  Silver
667   1904   St Louis  ...              Plunge For Distance  Bronze
...    ...        ...  ...                              ...     ...
2817  1912  Stockholm  ...       67.5 - 75KG (Middleweight)    Gold
2818  1912  Stockholm  ...       67.5 - 75KG (Middleweight)  Silver
2819  1912  Stockholm  ...  75 - 82.5KG (Light-Heavyweight)  Bronze
2820  1912  Stockholm  ...  75 - 82.5KG (Light-Heavyweight)  Silver
2821  1912  Stockholm  ...  75 - 82.5KG (Light-Heavyweight)  Silver

[2159 rows x 9 columns]

In [26]:
pd.concat([df_04,df_08,df_12],
          keys=('04','08','12'),
          names=['year_group', 'og_index'])

                     Year       City  ...                            Event   Medal
year_group og_index                   ...
04         663       1904   St Louis  ...                     10M Platform  Bronze
           664       1904   St Louis  ...                     10M Platform  Bronze
           665       1904   St Louis  ...                     10M Platform    Gold
           666       1904   St Louis  ...                     10M Platform  Silver
           667       1904   St Louis  ...              Plunge For Distance  Bronze
...                   ...        ...  ...                              ...     ...
12         2817      1912  Stockholm  ...       67.5 - 75KG (Middleweight)    Gold
           2818      1912  Stockholm  ...       67.5 - 75KG (Middleweight)  Silver
           2819      1912  Stockholm  ...  75 - 82.5KG (Light-Heavyweight)  Bronze
           2820      1912  Stockholm  ...  75 - 82.5KG (Light-Heavyweight)  Silver
           2821      1912  Stockholm  ...  75 - 82.5KG (Light-Heavyweight)  Silver

[2159 rows x 9 columns]